# SetSegmentVariableDirection Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeDefinitionBySegments..::..SetSegmentVariableDirection Method
RebarShapeDefinitionBySegments Class See Also
---
Remove the fixed direction from a segment.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetSegmentVariableDirection(
	int iSegment
)
```

Visual Basic
---
```text
Public Sub SetSegmentVariableDirection ( _
	iSegment As Integer _
)
```

Visual C++
---
```text
public:
void SetSegmentVariableDirection(
	int iSegment
)
```

# ### Parameters
iSegment
    Type: System..::..Int32 Index of the segment (0 to NumberOfSegments - 1).
# Remarks
The segment's angle will be allowed to vary, with a range of 90 degrees. The segment must have at least two constraints.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | iSegment is not between 0 and NumberOfSegments. |

# See Also
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace